{
  "00:00": {
    "spiritual": {
      "title": "Infinite Potential",
      "description": "00:00 represents a moment of pure potential and new beginnings. It marks the threshold between one day and the next, symbolizing transformation and renewal.",
      "guidance": "This is a powerful time to set intentions and connect with your highest aspirations. The universe is supporting fresh starts and new perspectives in your life."
    },
    "angel": {
      "name": "Guardian Angel Cassiel",
      "message": "Angel Cassiel, the overseer of endings and beginnings, appears with 00:00. This angel helps you release what no longer serves you and embrace new opportunities.",
      "guidance": "I am here to guide you through transitions. Release your fears about the unknown and trust in divine timing. The past is complete, and a new chapter awaits."
    },
    "numerology": {
      "title": "The Zero Point",
      "rootNumber": "0: Wholeness, potential, the void from which all manifestation arises",
      "mirrorEffect": "00:00 creates a perfect mirror reflecting infinite possibilities and the cyclical nature of time",
      "analysis": "The repetition of zero in 00:00 signifies a cosmic reset point. This time marks a moment when you can step outside normal constraints and access the unlimited potential of the universe. Zero represents both emptiness and fullness—the paradox of existence itself."
    }
  },
  "01:01": {
    "spiritual": {
      "title": "New Beginnings",
      "description": "01:01 signifies the start of a new spiritual journey. This mirror hour represents independence, initiative, and the courage to embark on new paths.",
      "guidance": "The universe is encouraging you to take the first step toward your dreams. Trust your instincts and embrace leadership opportunities that present themselves."
    },
    "angel": {
      "name": "Guardian Angel Elemiah",
      "message": "Angel Elemiah appears with 01:01, bringing energies of innovation and self-reliance. This angel helps you discover your unique path and divine purpose.",
      "guidance": "I am supporting your individual journey. Have courage to walk your own path, even when it differs from others. Your uniqueness is your greatest strength."
    },
    "numerology": {
      "title": "The Power of One",
      "rootNumber": "1: Leadership, individuality, new beginnings",
      "mirrorEffect": "01:01 amplifies the pioneering energy of 1, creating a gateway for manifestation",
      "analysis": "In numerology, 01:01 emphasizes the number 1's qualities of innovation and independence. The mirrored ones represent aligned action and the power of focused intention. This time reminds you that you are the creator of your reality through your thoughts and actions."
    }
  },
  "02:02": {
    "spiritual": {
      "title": "Balance & Partnership",
      "description": "02:02 symbolizes harmony, cooperation, and divine partnerships. This mirror hour reminds you of the importance of balance between giving and receiving.",
      "guidance": "Pay attention to your relationships and how you collaborate with others. The universe is highlighting the need for diplomacy and peaceful cooperation in your life."
    },
    "angel": {
      "name": "Guardian Angel Jeliel",
      "message": "Angel Jeliel, associated with love and wisdom, appears with 02:02. This angel helps restore harmony in relationships and assists in finding your divine counterpart.",
      "guidance": "I bring peace to your connections with others. Trust in the balance of giving and receiving. When you honor both yourself and others, true harmony emerges."
    },
    "numerology": {
      "title": "The Energy of Duality",
      "rootNumber": "2: Cooperation, diplomacy, intuition, partnerships",
      "mirrorEffect": "02:02 creates a balanced reflection emphasizing the importance of harmonious duality",
      "analysis": "In numerology, 02:02 highlights the number 2's qualities of patience and receptivity. This time signals the need to consider different perspectives and find middle ground. It reminds you that the most powerful creation comes through cooperation rather than competition."
    }
  },
  "03:03": {
    "spiritual": {
      "title": "Creative Expression",
      "description": "03:03 represents the trinity of mind, body, and spirit in perfect alignment. This mirror hour awakens creative potential and joyful self-expression.",
      "guidance": "The universe is encouraging you to express your authentic self. Share your gifts, communicate your truth, and embrace expansion in all forms."
    },
    "angel": {
      "name": "Guardian Angel Hahasiah",
      "message": "Angel Hahasiah, the angel of universal medicine and healing through creativity, appears with 03:03. This angel helps unblock creative channels and discover hidden talents.",
      "guidance": "I inspire your self-expression and joyful creation. Allow your natural enthusiasm to flow freely. Your creative energy is healing not only for yourself but for others as well."
    },
    "numerology": {
      "title": "The Power of Expression",
      "rootNumber": "3: Creativity, communication, joy, growth",
      "mirrorEffect": "03:03 amplifies creative and expressive energies, creating a portal for manifestation through words and art",
      "analysis": "In numerology, 03:03 emphasizes the number 3's vibration of creativity and communication. This time encourages you to express your unique perspective and share your joy with others. It signals a period of growth and expansion in your creative endeavors."
    }
  },
  "04:04": {
    "spiritual": {
      "title": "Foundation & Stability",
      "description": "04:04 symbolizes solid foundations and stable structures in both physical and spiritual realms. This mirror hour represents order, discipline, and methodical progress.",
      "guidance": "The universe is highlighting the importance of creating reliable systems in your life. Focus on building strong foundations for your future growth and security."
    },
    "angel": {
      "name": "Guardian Angel Elemiah",
      "message": "Angel Elemiah, the angel of divine structure and protection, appears with 04:04. This angel helps establish order from chaos and provides stability during times of change.",
      "guidance": "I bring strength to your foundations. Trust in the process of methodical building. With patience and persistence, your efforts will create lasting results that support your highest purpose."
    },
    "numerology": {
      "title": "The Energy of Structure",
      "rootNumber": "4: Stability, order, determination, practical building",
      "mirrorEffect": "04:04 doubles the foundation energy, emphasizing the importance of strong bases for future growth",
      "analysis": "In numerology, 04:04 embodies the number 4's qualities of organization and diligence. This time reminds you that great achievements require planning and consistent effort. It signifies a period when your hard work will create lasting structures in your life."
    }
  },
  "05:05": {
    "spiritual": {
      "title": "Freedom & Change",
      "description": "05:05 represents liberation from restrictions and embracing positive change. This mirror hour symbolizes adventure, versatility, and the courage to embrace the unknown.",
      "guidance": "The universe is encouraging you to step out of your comfort zone. Be adaptable, welcome change, and trust that these transitions are leading you toward greater freedom."
    },
    "angel": {
      "name": "Guardian Angel Mahasiah",
      "message": "Angel Mahasiah, the angel of healing through change, appears with 05:05. This angel helps release old patterns and embrace new experiences with enthusiasm.",
      "guidance": "I bring winds of positive change into your life. Embrace versatility and adapt to new circumstances with confidence. Your willingness to change is your path to growth."
    },
    "numerology": {
      "title": "The Energy of Freedom",
      "rootNumber": "5: Change, freedom, adventure, versatility",
      "mirrorEffect": "05:05 amplifies transformative energies, creating opportunities for significant positive changes",
      "analysis": "In numerology, 05:05 emphasizes the number 5's vibration of freedom and adventure. This time signals that you're at a crossroads with multiple possibilities ahead. It reminds you that embracing change, rather than resisting it, leads to your greatest evolution."
    }
  },
  "10:10": {
    "spiritual": {
      "title": "Awakening & Alignment",
      "description": "When you encounter 10:10, the universe is signaling a time of perfect alignment. This mirror hour represents balance between the material and spiritual worlds, encouraging you to notice the synchronicities appearing in your life.",
      "guidance": "This is a powerful reminder to stay present and aware of your thoughts, as they are manifesting rapidly during this time. Focus on your spiritual development and trust that you are exactly where you need to be."
    },
    "angel": {
      "name": "Guardian Angel Hahasiah",
      "message": "Angel Hahasiah, associated with 10:10, brings a message of elevated consciousness and deeper understanding of universal mysteries. This angel guides you toward discovering hidden truths and developing your spiritual gifts.",
      "guidance": "Trust in the process of your spiritual evolution. I am here to help you transform obstacles into opportunities for growth. Stay aligned with your highest truth."
    },
    "numerology": {
      "title": "The Power of Number 10",
      "rootNumber": "1 (1+0=1): New beginnings, independence, leadership",
      "mirrorEffect": "10:10 doubles the energy of 10, enhancing its manifestation power",
      "analysis": "In numerology, 10:10 represents completion of a cycle and the beginning of something new. The number 1 appears twice, emphasizing its qualities of innovation and independence, while the zeros amplify this energy. This time encourages you to embrace new opportunities and trust your leadership abilities."
    }
  },
  "11:11": {
    "spiritual": {
      "title": "Spiritual Awakening",
      "description": "11:11 is one of the most powerful mirror hours, representing a gateway to higher consciousness. This time symbolizes spiritual awakening, intuitive insights, and alignment with your higher self.",
      "guidance": "When you see 11:11, the universe is inviting you to pay attention to your thoughts and intentions. This is a moment of manifestation where your inner reality creates your outer experience."
    },
    "angel": {
      "name": "Guardian Angel Lauviah",
      "message": "Angel Lauviah, the angel of revelation and celestial insight, appears with 11:11. This angel helps you recognize your divine nature and access higher realms of consciousness.",
      "guidance": "I am opening portals of awareness for you. Pay attention to your intuitive nudges and synchronicities around you. You are being guided toward your highest potential."
    },
    "numerology": {
      "title": "Master Number 11",
      "rootNumber": "11 is a master number (1+1=2, but 11 stands alone): Intuition, spiritual insight, enlightenment",
      "mirrorEffect": "11:11 creates a powerful portal of aligned energy, amplifying spiritual connection and manifestation",
      "analysis": "In numerology, 11:11 contains the master number 11 appearing twice, creating an extremely potent energetic signature. This time represents spiritual enlightenment, intuitive abilities, and the power to manifest through aligned thought. It reminds you that you are a co-creator with the universe."
    }
  },
  "12:12": {
    "spiritual": {
      "title": "Cosmic Harmony",
      "description": "12:12 symbolizes divine order and cosmic harmony. This mirror hour represents the completion of cycles and the integration of spiritual wisdom into material reality.",
      "guidance": "The universe is showing you that everything is unfolding in perfect divine timing. Trust the process of your life and recognize how all experiences contribute to your growth."
    },
    "angel": {
      "name": "Guardian Angel Hahaiah",
      "message": "Angel Hahaiah, the angel of universal laws and divine protection, appears with 12:12. This angel helps you understand the cosmic order and your place within it.",
      "guidance": "I reveal the divine patterns at work in your life. Trust that every experience serves your highest good. When you align with universal laws, you move in harmony with all creation."
    },
    "numerology": {
      "title": "Cosmic Completion",
      "rootNumber": "3 (1+2+1+2=6, 6÷2=3): Creativity, joy, expression",
      "mirrorEffect": "12:12 reflects cosmic order and the completion of significant life cycles",
      "analysis": "In numerology, 12:12 combines the energy of 1 (new beginnings), 2 (balance), and 3 (creative expression). This powerful combination represents the completion of one cycle and the beginning of another at a higher level of awareness. It signifies spiritual maturity and the ability to create with conscious intention."
    }
  },
  "13:13": {
    "spiritual": {
      "title": "Transformation & Rebirth",
      "description": "13:13 represents profound transformation and spiritual rebirth. This mirror hour symbolizes the death of old patterns and the emergence of new, more authentic ways of being.",
      "guidance": "The universe is supporting your metamorphosis. Release what no longer serves you and embrace the unknown with courage. What appears as an ending is actually a powerful new beginning."
    },
    "angel": {
      "name": "Guardian Angel Iezalel",
      "message": "Angel Iezalel, the angel of transformation and reconciliation, appears with 13:13. This angel helps navigate major life transitions and find the gift within challenges.",
      "guidance": "I am guiding you through this metamorphosis. Trust that what is falling away is making room for something more aligned with your true self. Surrender to this process of becoming."
    },
    "numerology": {
      "title": "Sacred Transformation",
      "rootNumber": "4 (1+3+1+3=8, 8÷2=4): Stability, foundation, practical building",
      "mirrorEffect": "13:13 creates a mirror of transformative energy, doubling the power of change and rebirth",
      "analysis": "In numerology, 13:13 combines the initiating energy of 1 with the transformative power of 3. The number 13 is often misunderstood, but represents sacred transformation and divine feminine wisdom. This time signals that major changes occurring now are creating stable foundations (4) for your future evolution."
    }
  },
  "22:22": {
    "spiritual": {
      "title": "Balance & Harmony",
      "description": "22:22 carries a powerful message of balance and harmony in your life. This mirror hour is associated with spiritual partnerships and strong manifestation energy.",
      "guidance": "Pay attention to your thoughts and intentions during this time, as the universe is supporting your ability to create and manifest."
    },
    "angel": {
      "name": "Guardian Angel Leuviah",
      "message": "Angel Leuviah is associated with 22:22 and brings messages of inner wisdom and divine memory. This angel helps you access deeper levels of understanding.",
      "guidance": "Trust your intuition now, as it is divinely guided. I am here to help you embrace your truth and connect to universal wisdom."
    },
    "numerology": {
      "title": "Master Number 22",
      "rootNumber": "4 (2+2+2+2=8, 8÷2=4): Foundation, stability, practical building",
      "mirrorEffect": "22:22 amplifies the master builder energy of 22, bringing powerful manifestation potential",
      "analysis": "In numerology, 22 is a master number representing the master builder. When you see 22:22, it indicates a time when you can build solid foundations and bring your dreams into physical reality through practical effort."
    }
  }
}
