{
  "00:00": {
    "spiritual": {
      "title": "Potentiel Infini",
      "description": "00h00 représente un moment de pur potentiel et de nouveaux départs. Il marque le seuil entre un jour et le suivant, symbolisant la transformation et le renouveau.",
      "guidance": "C'est un moment puissant pour établir des intentions et vous connecter à vos plus hautes aspirations. L'univers soutient les nouveaux départs et les nouvelles perspectives dans votre vie."
    },
    "angel": {
      "name": "Ange Gardien Cassiel",
      "message": "L'Ange Cassiel, le surveillant des fins et des commencements, apparaît avec 00h00. Cet ange vous aide à libérer ce qui ne vous sert plus et à embrasser de nouvelles opportunités.",
      "guidance": "Je suis là pour vous guider à travers les transitions. Libérez vos peurs de l'inconnu et faites confiance au timing divin. Le passé est complet, et un nouveau chapitre vous attend."
    },
    "numerology": {
      "title": "Le Point Zéro",
      "rootNumber": "0: Plénitude, potentiel, le vide d'où surgit toute manifestation",
      "mirrorEffect": "00h00 crée un miroir parfait reflétant les possibilités infinies et la nature cyclique du temps",
      "analysis": "La répétition du zéro dans 00h00 signifie un point de réinitialisation cosmique. Cette heure marque un moment où vous pouvez sortir des contraintes normales et accéder au potentiel illimité de l'univers. Zéro représente à la fois le vide et la plénitude - le paradoxe de l'existence même."
    }
  },
  "01:01": {
    "spiritual": {
      "title": "Nouveaux Départs",
      "description": "01h01 signifie le début d'un nouveau voyage spirituel. Cette heure miroir représente l'indépendance, l'initiative et le courage d'emprunter de nouveaux chemins.",
      "guidance": "L'univers vous encourage à faire le premier pas vers vos rêves. Faites confiance à votre instinct et saisissez les opportunités de leadership qui se présentent."
    },
    "angel": {
      "name": "Ange Gardien Elemiah",
      "message": "L'Ange Elemiah apparaît avec 01h01, apportant des énergies d'innovation et d'autonomie. Cet ange vous aide à découvrir votre chemin unique et votre objectif divin.",
      "guidance": "Je soutiens votre voyage individuel. Ayez le courage de suivre votre propre chemin, même s'il diffère des autres. Votre unicité est votre plus grande force."
    },
    "numerology": {
      "title": "Le Pouvoir de Un",
      "rootNumber": "1: Leadership, individualité, nouveaux commencements",
      "mirrorEffect": "01h01 amplifie l'énergie pionnière du 1, créant une passerelle pour la manifestation",
      "analysis": "En numérologie, 01h01 met l'accent sur les qualités d'innovation et d'indépendance du nombre 1. Les uns reflétés représentent l'action alignée et le pouvoir de l'intention focalisée. Cette heure vous rappelle que vous êtes le créateur de votre réalité à travers vos pensées et vos actions."
    }
  },
  "02:02": {
    "spiritual": {
      "title": "Équilibre et Partenariat",
      "description": "02h02 symbolise l'harmonie, la coopération et les partenariats divins. Cette heure miroir vous rappelle l'importance de l'équilibre entre donner et recevoir.",
      "guidance": "Faites attention à vos relations et à la façon dont vous collaborez avec les autres. L'univers souligne le besoin de diplomatie et de coopération pacifique dans votre vie."
    },
    "angel": {
      "name": "Ange Gardien Jeliel",
      "message": "L'Ange Jeliel, associé à l'amour et à la sagesse, apparaît avec 02h02. Cet ange aide à restaurer l'harmonie dans les relations et aide à trouver votre contrepartie divine.",
      "guidance": "J'apporte la paix à vos connexions avec les autres. Faites confiance à l'équilibre entre donner et recevoir. Quand vous honorez à la fois vous-même et les autres, une véritable harmonie émerge."
    },
    "numerology": {
      "title": "L'Énergie de la Dualité",
      "rootNumber": "2: Coopération, diplomatie, intuition, partenariats",
      "mirrorEffect": "02h02 crée une réflexion équilibrée soulignant l'importance de la dualité harmonieuse",
      "analysis": "En numérologie, 02h02 met en évidence les qualités de patience et de réceptivité du nombre 2. Cette heure signale le besoin de considérer différentes perspectives et de trouver un terrain d'entente. Elle vous rappelle que la création la plus puissante vient de la coopération plutôt que de la compétition."
    }
  },
  "03:03": {
    "spiritual": {
      "title": "Expression Créative",
      "description": "03h03 représente la trinité du corps, de l'esprit et de l'âme en parfait alignement. Cette heure miroir éveille le potentiel créatif et l'expression authentique de soi.",
      "guidance": "L'univers vous encourage à exprimer votre véritable nature. Partagez vos dons, communiquez votre vérité et embrassez l'expansion sous toutes ses formes."
    },
    "angel": {
      "name": "Ange Gardien Hahasiah",
      "message": "L'Ange Hahasiah, l'ange de la médecine universelle et de la guérison par la créativité, apparaît avec 03h03. Cet ange aide à débloquer les canaux créatifs et à découvrir des talents cachés.",
      "guidance": "J'inspire votre expression personnelle et votre création joyeuse. Laissez votre enthousiasme naturel couler librement. Votre énergie créative est guérissante non seulement pour vous-même mais aussi pour les autres."
    },
    "numerology": {
      "title": "Le Pouvoir de l'Expression",
      "rootNumber": "3: Créativité, communication, joie, croissance",
      "mirrorEffect": "03h03 amplifie les énergies créatives et expressives, créant un portail pour la manifestation à travers les mots et l'art",
      "analysis": "En numérologie, 03h03 met l'accent sur la vibration de créativité et de communication du nombre 3. Cette heure vous encourage à exprimer votre perspective unique et à partager votre joie avec les autres. Elle signale une période de croissance et d'expansion dans vos entreprises créatives."
    }
  },
  "04:04": {
    "spiritual": {
      "title": "Fondation et Stabilité",
      "description": "04h04 symbolise des fondations solides et des structures stables dans les domaines physique et spirituel. Cette heure miroir représente l'ordre, la discipline et le progrès méthodique.",
      "guidance": "L'univers souligne l'importance de créer des systèmes fiables dans votre vie. Concentrez-vous sur la construction de fondations solides pour votre croissance et votre sécurité futures."
    },
    "angel": {
      "name": "Ange Gardien Elemiah",
      "message": "L'Ange Elemiah, l'ange de la structure divine et de la protection, apparaît avec 04h04. Cet ange aide à établir l'ordre à partir du chaos et apporte la stabilité en période de changement.",
      "guidance": "J'apporte de la force à vos fondations. Faites confiance au processus de construction méthodique. Avec patience et persévérance, vos efforts créeront des résultats durables qui soutiendront votre plus haut dessein."
    },
    "numerology": {
      "title": "L'Énergie de la Structure",
      "rootNumber": "4: Stabilité, ordre, détermination, construction pratique",
      "mirrorEffect": "04h04 double l'énergie de fondation, soulignant l'importance de bases solides pour la croissance future",
      "analysis": "En numérologie, 04h04 incarne les qualités d'organisation et de diligence du nombre 4. Cette heure vous rappelle que les grandes réalisations nécessitent planification et effort constant. Elle signifie une période où votre travail acharné créera des structures durables dans votre vie."
    }
  },
  "05:05": {
    "spiritual": {
      "title": "Liberté et Changement",
      "description": "05h05 représente la libération des restrictions et l'adoption de changements positifs. Cette heure miroir symbolise l'aventure, la polyvalence et le courage d'embrasser l'inconnu.",
      "guidance": "L'univers vous encourage à sortir de votre zone de confort. Soyez adaptable, accueillez le changement et faites confiance que ces transitions vous mènent vers une plus grande liberté."
    },
    "angel": {
      "name": "Ange Gardien Mahasiah",
      "message": "L'Ange Mahasiah, l'ange de la guérison par le changement, apparaît avec 05h05. Cet ange aide à libérer les anciens schémas et à embrasser de nouvelles expériences avec enthousiasme.",
      "guidance": "J'apporte des vents de changement positif dans votre vie. Embrassez la polyvalence et adaptez-vous aux nouvelles circonstances avec confiance. Votre volonté de changer est votre chemin vers la croissance."
    },
    "numerology": {
      "title": "L'Énergie de la Liberté",
      "rootNumber": "5: Changement, liberté, aventure, polyvalence",
      "mirrorEffect": "05h05 amplifie les énergies transformatrices, créant des opportunités pour des changements positifs significatifs",
      "analysis": "En numérologie, 05h05 met l'accent sur la vibration de liberté et d'aventure du nombre 5. Cette heure signale que vous êtes à un carrefour avec de multiples possibilités devant vous. Elle vous rappelle qu'embrasser le changement, plutôt que d'y résister, mène à votre plus grande évolution."
    }
  },
  "10:10": {
    "spiritual": {
      "title": "Éveil et Alignement",
      "description": "10h10 symbolise l'éveil spirituel et l'alignement avec votre véritable objectif. Cette heure miroir indique le début d'un nouveau niveau de conscience et de connexion divine.",
      "guidance": "Faites attention à vos pensées à ce moment précis. L'univers vous montre que vos intentions se manifestent rapidement. Alignez vos pensées avec vos plus hautes aspirations."
    },
    "angel": {
      "name": "Ange Gardien Lehaviah",
      "message": "L'Ange Lehaviah, l'ange de la clarté et de la confiance divine, apparaît avec 10h10. Cet ange renforce votre foi en votre voyage spirituel et illumine votre chemin vers l'avant.",
      "guidance": "Je suis là pour illuminer votre chemin. Faites confiance à la guidance intérieure qui vous arrive maintenant. Vous êtes sur le point d'entrer dans une nouvelle phase d'éveil spirituel."
    },
    "numerology": {
      "title": "Nombre de l'Éveil",
      "rootNumber": "1 (1+0+1+0=2, mais on garde aussi la présence forte du 1 et du 0): Nouveaux départs, leadership, potentiel illimité",
      "mirrorEffect": "10h10 crée un puissant champ d'énergie pour activer votre conscience supérieure",
      "analysis": "En numérologie, 10h10 contient l'énergie de 10 (completion d'un cycle) apparaissant deux fois. Cette heure représente un moment d'opportunité ultime où la sagesse intérieure peut guider vos actions extérieures. Elle vous rappelle que vous vous tenez à la frontière d'un nouveau niveau de conscience."
    }
  },
  "11:11": {
    "spiritual": {
      "title": "Éveil Spirituel",
      "description": "11h11 est l'une des heures miroir les plus puissantes, représentant une passerelle vers une conscience supérieure. Cette heure symbolise l'éveil spirituel, les intuitions intuitives et l'alignement avec votre moi supérieur.",
      "guidance": "Quand vous voyez 11h11, l'univers vous invite à prêter attention à vos pensées et intentions. C'est un moment de manifestation où votre réalité intérieure crée votre expérience extérieure."
    },
    "angel": {
      "name": "Ange Gardien Lauviah",
      "message": "L'Ange Lauviah, l'ange de la révélation et de l'intuition céleste, apparaît avec 11h11. Cet ange vous aide à reconnaître votre nature divine et à accéder à des royaumes supérieurs de conscience.",
      "guidance": "J'ouvre des portails de conscience pour vous. Faites attention à vos intuitions et aux synchronicités autour de vous. Vous êtes guidé vers votre plus haut potentiel."
    },
    "numerology": {
      "title": "Nombre Maître 11",
      "rootNumber": "11 est un nombre maître (1+1=2, mais 11 reste entier): Intuition, perspicacité spirituelle, illumination",
      "mirrorEffect": "11h11 crée un puissant portail d'énergie alignée, amplifiant la connexion spirituelle et la manifestation",
      "analysis": "En numérologie, 11h11 contient le nombre maître 11 apparaissant deux fois, créant une signature énergétique extrêmement puissante. Cette heure représente l'illumination spirituelle, les capacités intuitives et le pouvoir de manifester à travers la pensée alignée. Elle vous rappelle que vous êtes un co-créateur avec l'univers."
    }
  },
  "12:12": {
    "spiritual": {
      "title": "Harmonie Cosmique",
      "description": "12h12 symbolise l'ordre divin et l'harmonie cosmique. Cette heure miroir représente l'achèvement des cycles et l'intégration de la sagesse spirituelle dans la réalité matérielle.",
      "guidance": "L'univers vous montre que tout se déroule dans un timing divin parfait. Faites confiance au processus de votre vie et reconnaissez comment toutes les expériences contribuent à votre croissance."
    },
    "angel": {
      "name": "Ange Gardien Hahaiah",
      "message": "L'Ange Hahaiah, l'ange des lois universelles et de la protection divine, apparaît avec 12h12. Cet ange vous aide à comprendre l'ordre cosmique et votre place en son sein.",
      "guidance": "Je révèle les modèles divins à l'œuvre dans votre vie. Ayez confiance que chaque expérience sert votre plus grand bien. Lorsque vous vous alignez avec les lois universelles, vous vous déplacez en harmonie avec toute la création."
    },
    "numerology": {
      "title": "Achèvement Cosmique",
      "rootNumber": "3 (1+2+1+2=6, 6÷2=3): Créativité, joie, expression",
      "mirrorEffect": "12h12 reflète l'ordre cosmique et l'achèvement d'un cycle de vie significatif",
      "analysis": "En numérologie, 12h12 totalise 6, le nombre de l'harmonie et de la responsabilité. Cette heure signale un moment d'intégration où la sagesse spirituelle peut être appliquée à votre vie quotidienne. Elle vous rappelle que vous êtes à un point d'achèvement et de transition vers un nouveau niveau d'expérience."
    }
  }
}